app/views/todo_lists/index.html.erb

<script type="text/javascript">
	$(function() {
		TASKS = $('#all_lists').html();
		var list_div = $('#lists');


		function render(tasks) {
			var tasks = JSON.parse(tasks);
			_.each(tasks, function(list, i) {
				var $p = $('<p></p>');
				var list_link = $('<a href="#">' + list.title + '</a>');
				list_link.attr('id', 'list_' + i);
				$p.html(list_link);
				list_div.append($p);

				var templateCode = $("#list_items").html();
				var templateFunction = _.template(templateCode);
				var renderedTemplate = templateFunction({
					items: list.items
				});
				$p.append(renderedTemplate);
				$p.find('ul').hide();
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."list_id" = 2


		$("#new_list_form").on('ajax:success', function(event, data) {
			var $p = $('<p></p>');
			var list_link = $('<a href="#"></a>');
			list_link.attr('id', 'list_' + (JSON.parse(TASKS).length))
			list_link.text(data.title);
			$p.html(list_link);
			$('#lists').append($p);
			parsed_tasks = JSON.parse(TASKS);
			parsed_tasks.push(data);
			obj_string = JSON.stringify(parsed_tasks);
			TASKS = obj_string;
		});
---
INSERT INTO "todo_lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 21 Jun 2013 20:22:54 UTC +00:00], ["title", "Things to See"], ["updated_at", Fri, 21 Jun 2013 20:22:54 UTC +00:00]]