app/controllers/todo_items_controller.rb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
	def destroy
		@todo_item = TodoItem.find(params[:id])
		@todo_item.destroy