app/controllers/todo_lists_controller.rb

	def create
		@todo_list = TodoList.new(params[:todo_list])
		# @todo_list.items.build(params[:todo_list][:items])
		@todo_list.save!
---
INSERT INTO "todo_lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 21 Jun 2013 16:48:07 UTC +00:00], ["title", "Shopping"], ["updated_at", Fri, 21 Jun 2013 16:48:07 UTC +00:00]]

	def destroy
		@todo_list = TodoList.find(params[:id])
		@todo_list.destroy
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]